app/controllers/games_controller.rb

SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    game = Game.find_by(id: params[:id])

INSERT INTO "games" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2019-06-22 08:15:30.399101"], ["updated_at", "2019-06-22 08:15:30.399101"]]
---
  def create
    game = Game.create({})

SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "moves" ("game_id", "x", "y", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["game_id", 1], ["x", 0], ["y", 0], ["created_at", "2019-06-22 08:19:15.703740"], ["updated_at", "2019-06-22 08:19:15.703740"]]
SELECT "moves".* FROM "moves" WHERE "moves"."game_id" = ?  [["game_id", 1]]
SELECT COUNT(*) FROM "moves" WHERE "moves"."game_id" = ?  [["game_id", 1]]
---
  def update
    game = Game.find_by(id: params[:id])
    new_move = Move.new(x: params[:x], y: params[:y], game_id: game.id)

    begin
      new_move.save

      if new_move.errors.empty? then render json: new_move