app/models/game.rb

SELECT COUNT(*) FROM "moves" WHERE "moves"."game_id" = ?  [["game_id", 1]]
---
  def is_finished?
    if self.get_winner != nil or self.moves.count == 9 then